// Напишите программу, которая на 
// вход принимает число и выдаёт 
// его квадрат (число умноженное на само себя). 
// Например: 4 -> 16; -3 -> 9; -7 -> 49
Console.WriteLine("Введите число: ");
int n = int.Parse(Console.ReadLine());
Console.WriteLine("Число: " + n);
Console.WriteLine("Квадрат: " + n*n);
